package com.company;

/**
 * И так есть маленький мальчик который очень любит
 * только четные числа, но у него есть большая проблемка
 * он не умеет различать четные числа от не четных( Но так как ты любишь маленьких карапузов,
 * ты не можешь пройти мимо его проблемы и поэтому решила написать для него метод который
 * принимает число и говорит оно четное или нет) (нужно использовать % )
 */
public class taskWithOstatok {
    public static void numbers(int number){
        if (number % 2 == 0){
            System.out.println("число четное");
        }else {
            System.out.println("число не четное");
        }
    }
}
