package com.company;

/**
 * Теперь мы поможем миньонам найти предводителя

 String leaders [] = {"Yes Man","Mutant","XZkto"};

 //И так у каждого из наших лидеров есть зарактеристики которые мы для удобства записали в массив
 // 0 - это хитрость, 1 - коварство, 2 - находчивость
 int skills0[] = {12,50,45}; // скилы "Yes Man"
 int skills1[] = {25,20,30}; // "Mutant"
 int skills2[] = {85,55,45}; // "XZkto"

 И так первым делом нашим миньонам нужен хитрометр, который для них ты и напишешь))
 Он должен принимать число и возвращать баллы по шкале хитрости)
 Если хитрость меньше 20 то это 2 бала если больше 80 то это 3 балла
 (слишком хитрый может обмануть наших миньончиков))))
 ну а если обольше 20 но меньше 80 то 5 баллов.

 Вывести на экран результаты на экран.

 Следующий шаг, необходимо определить какой средний потенциал у наших героев,
 для этого нужно написать метод который принимает масив и возвращает  среднее число.

 Ну и на последок немного посложнее, Необходимо написать метод который
 определяет какой скилл самый развитый , для этого напишем метод который
 будет принимать массив(скиллов) и искать самый большой скил, если это будет
 хитрость то 10 балов, если коварство то 15 ну и если находчивость то 25 балов.
 ( сначала ищем самое большое число запомонаем его номер в масиве, а потом по этому номеру
 узнаем что это за скилл)


 И так следующий этап называется у кого больше) (Любимое соревнование у мужчин)

 Написать метод который принимает все 3 массива. Скилы каждого претендента суммируются и определяется
 у кого больше балов. первое место 30 второе 20 и третье 10 баллов

 Ну и последнее что остается сделать так это посчитать кто же выиграл.
 Для для этого нужно будет объявить 3 глобальные переменные (глобальные это те которые будут видны в
 всем классе их обычно пишут после начала описания класса)
 В эти переменные записать количество баллов заработанных каждым участником. И потом вывести победную
 таблицу на экран.
 она должна выглядеть примерно так:
 1 Имя  - колличество очков
 2 Имя  - колличество очков
 3 Имя  - колличество очков

 */
public class taskAboutMinions {
}
